Config/Catalogs/ResourceTariffs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ResourceTariffs</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ResourceTariffs/Ext/ObjectModule.bsl
#Region EventHandlers

// --------------------------------------------------------------------------------
Procedure OnWrite(pCancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure // OnWrite

// --------------------------------------------------------------------------------
Procedure BeforeWrite(pCancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	If Not cmCheckUserPermissions("HavePermissionToManagePrices") Then
		If IsNew() Then
			Raise NStr("en='You do not have rights to manage prices!'; ru='У вас нет прав управлять ценами!'; de='Sie besitzen keine Rechte zur Preisverwaltung!'");
		Else
			If IsFolder Then
				If Ref.DeletionMark <> DeletionMark Or 
				   Ref.Code <> Code Or Ref.Description <> Description Or
				   Ref.Hotel <> Hotel Or Ref.Parent <> Parent Then
					pCancel = True;
					Raise NStr("en='You do not have rights to manage prices!'; ru='У вас нет прав управлять ценами!'; de='Sie besitzen keine Rechte zur Preisverwaltung!'");
				EndIf;
			Else
				If Ref.DeletionMark <> DeletionMark Or 
				   Ref.Code <> Code Or Ref.Description <> Description Or
				   Ref.Hotel <> Hotel Or Ref.Parent <> Parent Or 
				   Ref.Remarks <> Remarks Or Ref.SortCode <> SortCode Then
					pCancel = True;
					Raise NStr("en='You do not have rights to manage prices!'; ru='У вас нет прав управлять ценами!'; de='Sie besitzen keine Rechte zur Preisverwaltung!'");
				EndIf;
			EndIf;
		EndIf;
	EndIf;
EndProcedure // BeforeWrite

#EndRegion
